
# Формат входных данных
# На вход программе подаётся целое число x.

# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.

x = int(input())

if x <= - 3 or x >= 7:
    print("Принадлежит")
else:
    print("Не принадлежит")