# Формат входных данных
# На вход программе подаётся целое число x.

# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.

x = int(input())

if x > -1 and x < 17:
    print("Принадлежит")
else:
    print("Не принадлежит")
