# Формат входных данных
# На вход программе подаётся два различных целых числа.

# Формат выходных данных
# Программа должна вывести наименьшее из двух чисел.

first = int(input())
second = int(input())

if first < second:
    print(first)
else:
    print(second)
