# Формат входных данных
# На вход программе подаётся одно целое положительное число n∈[1;9]n,n∈[1;9].

# Формат выходных данных
# Программа должна вывести число n+nn+nnn.

n = int(input())
print(3 * n + 2 * n * 10 + n * 100)
