# Формат входных данных
# На вход программе подаётся четыре целых положительных числа a,b,c и d , каждое на отдельной строке в указанном порядке.

# Формат выходных данных
# Программа должна вывести значение a^b+c^d.

a = int(input())
b = int(input())
c = int(input())
d = int(input())

print(a**b + c**d)
