# Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

print("*****************")
print("*               *")
print("*               *")
print("*****************")
