# Формат входных данных
# На вход программе подаётся целое число – место с заданным номером в вагоне.

# Формат выходных данных
# Программа должна вывести одно число – номер купе, в котором находится указаное место.

position = int(input())
print((position + 3) // 4)
