# Формат входных данных
# На вход дается число целое n – население Вселенной.

# Формат выходных данных
# Программа должна вывести одно число – количество выживших.

n = int(input())
print(n // 2 + n % 2)
