# Формат входных данных
# На вход программе подаётся натуральное число – количество сантиметров.

# Формат выходных данных
# Программа должна вывести одно число – полное число метров.

santi = int(input())
metr = santi // 100
print(metr)
